[Survived] ObjectLiteral
lib/services/OrderService.ts:63:56
    */
   async createOrder(userId: string, dto: CreateOrderDTO): Promise<Order> {
     // Buscar usuário
-    const user = await prisma.user.findUnique({ where: { id: userId } })
+    const user = await prisma.user.findUnique({ where: {} })
     if (!user) throw new AppError('AUTH_001', 401)
 

[Killed] BooleanLiteral
lib/services/OrderService.ts:64:9
   async createOrder(userId: string, dto: CreateOrderDTO): Promise<Order> {
     // Buscar usuário
     const user = await prisma.user.findUnique({ where: { id: userId } })
-    if (!user) throw new AppError('AUTH_001', 401)
+    if (user) throw new AppError('AUTH_001', 401)
 
     // Buscar ativo pelo ticker (assetId)
killedBy: OrderService.createOrder cria ordem MARKET BUY com sucesso
statusReason: AppError: AUTH_001

[Killed] ConditionalExpression
lib/services/OrderService.ts:64:9
   async createOrder(userId: string, dto: CreateOrderDTO): Promise<Order> {
     // Buscar usuário
     const user = await prisma.user.findUnique({ where: { id: userId } })
-    if (!user) throw new AppError('AUTH_001', 401)
+    if (true) throw new AppError('AUTH_001', 401)
 
     // Buscar ativo pelo ticker (assetId)
killedBy: OrderService.createOrder cria ordem MARKET BUY com sucesso
statusReason: AppError: AUTH_001

[Survived] ObjectLiteral
lib/services/OrderService.ts:67:49
     if (!user) throw new AppError('AUTH_001', 401)
 
     // Buscar ativo pelo ticker (assetId)
-    const asset = await prisma.asset.findUnique({ where: { ticker: dto.ticker } })
+    const asset = await prisma.asset.findUnique({})
     if (!asset) throw new AppError('ASSET_031', 422, { ticker: dto.ticker, message: 'Ativo não encontrado.' })
 

[Killed] ConditionalExpression
lib/services/OrderService.ts:68:9
 
     // Buscar ativo pelo ticker (assetId)
     const asset = await prisma.asset.findUnique({ where: { ticker: dto.ticker } })
-    if (!asset) throw new AppError('ASSET_031', 422, { ticker: dto.ticker, message: 'Ativo não encontrado.' })
+    if (true) throw new AppError('ASSET_031', 422, { ticker: dto.ticker, message: 'Ativo não encontrado.' })
 
     // === Camada 1 — Validação de Plano ===
killedBy: OrderService.createOrder cria ordem MARKET BUY com sucesso
statusReason: AppError: ASSET_031

[Killed] BooleanLiteral
lib/services/OrderService.ts:68:9
 
     // Buscar ativo pelo ticker (assetId)
     const asset = await prisma.asset.findUnique({ where: { ticker: dto.ticker } })
-    if (!asset) throw new AppError('ASSET_031', 422, { ticker: dto.ticker, message: 'Ativo não encontrado.' })
+    if (asset) throw new AppError('ASSET_031', 422, { ticker: dto.ticker, message: 'Ativo não encontrado.' })
 
     // === Camada 1 — Validação de Plano ===
killedBy: OrderService.createOrder cria ordem MARKET BUY com sucesso
statusReason: AppError: ASSET_031

[Killed] BlockStatement
lib/services/OrderService.ts:72:32
 
     // === Camada 1 — Validação de Plano ===
     const planValidation = validateOrderForPlan(dto, user.planType as PlanType)
-    if (!planValidation.valid) {
-      throw new AppError('ORDER_051', 403, {
-        requiredPlan: planValidation.requiredPlan,
-        message: planValidation.message,
-      })
-    }
+    if (!planValidation.valid) {}
 
     // === Camada 2 — Limite Diário ===
killedBy: OrderService.createOrder lança ORDER_051 quando plano não permite LIMIT (Jogador)
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"assetId": "asset-1", "fee": 4.5, "id": "order-1", "quantity": 10, "side": "BUY", "status": "OPEN", "type": "MARKET", "userId": "user-1"}

[Killed] ConditionalExpression
lib/services/OrderService.ts:72:9
 
     // === Camada 1 — Validação de Plano ===
     const planValidation = validateOrderForPlan(dto, user.planType as PlanType)
-    if (!planValidation.valid) {
+    if (true) {
       throw new AppError('ORDER_051', 403, {
         requiredPlan: planValidation.requiredPlan,
killedBy: OrderService.createOrder cria ordem MARKET BUY com sucesso
statusReason: AppError: ORDER_051

[Killed] StringLiteral
lib/services/OrderService.ts:73:26
     // === Camada 1 — Validação de Plano ===
     const planValidation = validateOrderForPlan(dto, user.planType as PlanType)
     if (!planValidation.valid) {
-      throw new AppError('ORDER_051', 403, {
+      throw new AppError("", 403, {
         requiredPlan: planValidation.requiredPlan,
         message: planValidation.message,
killedBy: OrderService.createOrder lança ORDER_051 quando plano não permite LIMIT (Jogador)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ORDER_051"
Received: ""

[Killed] ConditionalExpression
lib/services/OrderService.ts:80:9
     }
 
     // === Camada 2 — Limite Diário ===
-    if (user.planType !== PLAN_TYPE.LENDA) {
+    if (false) {
       await this._checkDailyLimit(userId, user.planType as PlanType)
     }
killedBy: OrderService.createOrder lança ORDER_052 quando limite diário atingido (Jogador)
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"assetId": "asset-1", "fee": 4.5, "id": "order-1", "quantity": 10, "side": "BUY", "status": "OPEN", "type": "MARKET", "userId": "user-1"}

[Killed] EqualityOperator
lib/services/OrderService.ts:80:9
     }
 
     // === Camada 2 — Limite Diário ===
-    if (user.planType !== PLAN_TYPE.LENDA) {
+    if (user.planType === PLAN_TYPE.LENDA) {
       await this._checkDailyLimit(userId, user.planType as PlanType)
     }
killedBy: OrderService.createOrder lança ORDER_052 quando limite diário atingido (Jogador)
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"assetId": "asset-1", "fee": 4.5, "id": "order-1", "quantity": 10, "side": "BUY", "status": "OPEN", "type": "MARKET", "userId": "user-1"}

[Killed] ConditionalExpression
lib/services/OrderService.ts:86:9
 
     // === Camada 3 — Ativo em Halt (circuit breaker) ===
     // Verificar tanto o flag DB (isActive) quanto a chave Redis motor:halt:{ticker}
-    if (!asset.isActive) {
+    if (false) {
       throw new AppError('ASSET_030', 423, {
         ticker: dto.ticker,
killedBy: OrderService.createOrder lança ASSET_030 quando ativo em halt
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"assetId": "asset-1", "fee": 4.5, "id": "order-1", "quantity": 10, "side": "BUY", "status": "OPEN", "type": "MARKET", "userId": "user-1"}

[Killed] BooleanLiteral
lib/services/OrderService.ts:86:9
 
     // === Camada 3 — Ativo em Halt (circuit breaker) ===
     // Verificar tanto o flag DB (isActive) quanto a chave Redis motor:halt:{ticker}
-    if (!asset.isActive) {
+    if (asset.isActive) {
       throw new AppError('ASSET_030', 423, {
         ticker: dto.ticker,
killedBy: OrderService.createOrder cria ordem MARKET BUY com sucesso
statusReason: AppError: ASSET_030

[Survived] StringLiteral
lib/services/OrderService.ts:89:18
     if (!asset.isActive) {
       throw new AppError('ASSET_030', 423, {
         ticker: dto.ticker,
-        message: 'Ativo temporariamente suspenso por circuit breaker.',
+        message: "",
       })
     }

[Killed] ArrowFunction
lib/services/OrderService.ts:93:71
       })
     }
 
-    const haltKey = await redis.get(`motor:halt:${dto.ticker}`).catch(() => null)
+    const haltKey = await redis.get(`motor:halt:${dto.ticker}`).catch(() => undefined)
     if (haltKey !== null) {
       let haltReason: string | undefined
killedBy: OrderService.createOrder trata erro de Redis no check de halt (catch → null, sem halt)
statusReason: AppError: ASSET_030

[Killed] StringLiteral
lib/services/OrderService.ts:93:37
       })
     }
 
-    const haltKey = await redis.get(`motor:halt:${dto.ticker}`).catch(() => null)
+    const haltKey = await redis.get(``).catch(() => null)
     if (haltKey !== null) {
       let haltReason: string | undefined
killedBy: OrderService.createOrder lança ASSET_030 quando halt no Redis com reason (JSON válido)
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"assetId": "asset-1", "fee": 4.5, "id": "order-1", "quantity": 10, "side": "BUY", "status": "OPEN", "type": "MARKET", "userId": "user-1"}

[Killed] ConditionalExpression
lib/services/OrderService.ts:94:9
     }
 
     const haltKey = await redis.get(`motor:halt:${dto.ticker}`).catch(() => null)
-    if (haltKey !== null) {
+    if (false) {
       let haltReason: string | undefined
       try {
killedBy: OrderService.createOrder lança ASSET_030 quando halt no Redis com reason (JSON válido)
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"assetId": "asset-1", "fee": 4.5, "id": "order-1", "quantity": 10, "side": "BUY", "status": "OPEN", "type": "MARKET", "userId": "user-1"}

[Killed] EqualityOperator
lib/services/OrderService.ts:94:9
     }
 
     const haltKey = await redis.get(`motor:halt:${dto.ticker}`).catch(() => null)
-    if (haltKey !== null) {
+    if (haltKey === null) {
       let haltReason: string | undefined
       try {
killedBy: OrderService.createOrder cria ordem MARKET BUY com sucesso
statusReason: AppError: ASSET_030

[Survived] BlockStatement
lib/services/OrderService.ts:96:11
     const haltKey = await redis.get(`motor:halt:${dto.ticker}`).catch(() => null)
     if (haltKey !== null) {
       let haltReason: string | undefined
-      try {
-        const parsed = JSON.parse(haltKey) as { reason?: string }
-        haltReason = parsed.reason
-      } catch {
+      try {} catch {
         // chave malformada — tratar como halt ativo
       }

[Killed] StringLiteral
lib/services/OrderService.ts:102:26
       } catch {
         // chave malformada — tratar como halt ativo
       }
-      throw new AppError('ASSET_030', 422, {
+      throw new AppError("", 422, {
         ticker: dto.ticker,
         message: haltReason
killedBy: OrderService.createOrder lança ASSET_030 quando halt no Redis com reason (JSON válido)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ASSET_030"
Received: ""

[Survived] ObjectLiteral
lib/services/OrderService.ts:102:44
       } catch {
         // chave malformada — tratar como halt ativo
       }
-      throw new AppError('ASSET_030', 422, {
-        ticker: dto.ticker,
-        message: haltReason
-          ? `Ativo suspenso pelo administrador: ${haltReason}`
-          : 'Ativo temporariamente suspenso pelo administrador.',
-      })
+      throw new AppError('ASSET_030', 422, {})
     }
 

[Killed] EqualityOperator
lib/services/OrderService.ts:111:9
     }
 
     // === Camada 4 — Sessão de Mercado (apenas MARKET) ===
-    if (dto.type === ORDER_TYPE.MARKET) {
+    if (dto.type !== ORDER_TYPE.MARKET) {
       await this._checkMarketSession()
     }
killedBy: OrderService.createOrder lança SESS_040 quando sessão de mercado está FECHADO
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"assetId": "asset-1", "fee": 4.5, "id": "order-1", "quantity": 10, "side": "BUY", "status": "OPEN", "type": "MARKET", "userId": "user-1"}

[Killed] BlockStatement
lib/services/OrderService.ts:111:41
     }
 
     // === Camada 4 — Sessão de Mercado (apenas MARKET) ===
-    if (dto.type === ORDER_TYPE.MARKET) {
-      await this._checkMarketSession()
-    }
+    if (dto.type === ORDER_TYPE.MARKET) {}
 
     // === Camada 5 — Saldo ===
killedBy: OrderService.createOrder lança SESS_040 quando sessão de mercado está FECHADO
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"assetId": "asset-1", "fee": 4.5, "id": "order-1", "quantity": 10, "side": "BUY", "status": "OPEN", "type": "MARKET", "userId": "user-1"}

[Survived] ArithmeticOperator
lib/services/OrderService.ts:117:28
 
     // === Camada 5 — Saldo ===
     const executionPrice = Number(asset.currentPrice)
-    const operationValue = dto.quantity * executionPrice
+    const operationValue = dto.quantity / executionPrice
     const feeAmount = calculateFee(operationValue)
     let requiredBalance: number

[Killed] ConditionalExpression
lib/services/OrderService.ts:121:9
     const feeAmount = calculateFee(operationValue)
     let requiredBalance: number
 
-    if (dto.side === 'BUY') {
+    if (true) {
       const leverageMultiplier = dto.leverage === 2 ? 0.5 : 1
       requiredBalance = operationValue * leverageMultiplier + feeAmount
killedBy: OrderService.createOrder lança ORDER_050 para SELL sem posição aberta
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"assetId": "asset-1", "fee": 4.5, "id": "order-1", "quantity": 10, "side": "BUY", "status": "OPEN", "type": "MARKET", "userId": "user-1"}

[Killed] ConditionalExpression
lib/services/OrderService.ts:121:9
     const feeAmount = calculateFee(operationValue)
     let requiredBalance: number
 
-    if (dto.side === 'BUY') {
+    if (false) {
       const leverageMultiplier = dto.leverage === 2 ? 0.5 : 1
       requiredBalance = operationValue * leverageMultiplier + feeAmount
killedBy: OrderService.createOrder cria ordem MARKET BUY com sucesso
statusReason: AppError: ORDER_050

[Survived] EqualityOperator
lib/services/OrderService.ts:122:34
     let requiredBalance: number
 
     if (dto.side === 'BUY') {
-      const leverageMultiplier = dto.leverage === 2 ? 0.5 : 1
+      const leverageMultiplier = dto.leverage !== 2 ? 0.5 : 1
       requiredBalance = operationValue * leverageMultiplier + feeAmount
     } else {

[Survived] ConditionalExpression
lib/services/OrderService.ts:122:34
     let requiredBalance: number
 
     if (dto.side === 'BUY') {
-      const leverageMultiplier = dto.leverage === 2 ? 0.5 : 1
+      const leverageMultiplier = false ? 0.5 : 1
       requiredBalance = operationValue * leverageMultiplier + feeAmount
     } else {

[Survived] ArithmeticOperator
lib/services/OrderService.ts:123:25
 
     if (dto.side === 'BUY') {
       const leverageMultiplier = dto.leverage === 2 ? 0.5 : 1
-      requiredBalance = operationValue * leverageMultiplier + feeAmount
+      requiredBalance = operationValue * leverageMultiplier - feeAmount
     } else {
       // SELL: verificar que usuário tem a posição

[Survived] ArithmeticOperator
lib/services/OrderService.ts:123:25
 
     if (dto.side === 'BUY') {
       const leverageMultiplier = dto.leverage === 2 ? 0.5 : 1
-      requiredBalance = operationValue * leverageMultiplier + feeAmount
+      requiredBalance = operationValue / leverageMultiplier + feeAmount
     } else {
       // SELL: verificar que usuário tem a posição

[Killed] BlockStatement
lib/services/OrderService.ts:124:12
     if (dto.side === 'BUY') {
       const leverageMultiplier = dto.leverage === 2 ? 0.5 : 1
       requiredBalance = operationValue * leverageMultiplier + feeAmount
-    } else {
-      // SELL: verificar que usuário tem a posição
-      const position = await prisma.position.findFirst({
-        where: { userId, assetId: asset.id, status: 'OPEN', side: 'LONG' },
-      })
-      const ownedQty = position?.quantity ?? 0
-      if (ownedQty < dto.quantity) {
-        throw new AppError('ORDER_050', 402, {
-          required: dto.quantity,
-          available: ownedQty,
-          message: `Saldo de ativos insuficiente. Você tem ${ownedQty} ${dto.ticker}, mas a ordem requer ${dto.quantity}.`,
-        })
-      }
-      requiredBalance = 0 // SELL não requer saldo em FS$
-    }
+    } else {}
 
     // === Motor Health Check (MARKET apenas) ===
killedBy: OrderService.createOrder lança ORDER_050 para SELL sem posição aberta
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"assetId": "asset-1", "fee": 4.5, "id": "order-1", "quantity": 10, "side": "BUY", "status": "OPEN", "type": "MARKET", "userId": "user-1"}

[Survived] StringLiteral
lib/services/OrderService.ts:127:67
     } else {
       // SELL: verificar que usuário tem a posição
       const position = await prisma.position.findFirst({
-        where: { userId, assetId: asset.id, status: 'OPEN', side: 'LONG' },
+        where: { userId, assetId: asset.id, status: 'OPEN', side: "" },
       })
       const ownedQty = position?.quantity ?? 0

[Survived] StringLiteral
lib/services/OrderService.ts:127:53
     } else {
       // SELL: verificar que usuário tem a posição
       const position = await prisma.position.findFirst({
-        where: { userId, assetId: asset.id, status: 'OPEN', side: 'LONG' },
+        where: { userId, assetId: asset.id, status: "", side: 'LONG' },
       })
       const ownedQty = position?.quantity ?? 0

[Killed] LogicalOperator
lib/services/OrderService.ts:129:24
       const position = await prisma.position.findFirst({
         where: { userId, assetId: asset.id, status: 'OPEN', side: 'LONG' },
       })
-      const ownedQty = position?.quantity ?? 0
+      const ownedQty = position?.quantity && 0
       if (ownedQty < dto.quantity) {
         throw new AppError('ORDER_050', 402, {
killedBy: OrderService.createOrder lança ORDER_050 para SELL sem posição aberta
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"assetId": "asset-1", "fee": 4.5, "id": "order-1", "quantity": 10, "side": "BUY", "status": "OPEN", "type": "MARKET", "userId": "user-1"}

[Killed] OptionalChaining
lib/services/OrderService.ts:129:24
       const position = await prisma.position.findFirst({
         where: { userId, assetId: asset.id, status: 'OPEN', side: 'LONG' },
       })
-      const ownedQty = position?.quantity ?? 0
+      const ownedQty = position.quantity ?? 0
       if (ownedQty < dto.quantity) {
         throw new AppError('ORDER_050', 402, {
killedBy: OrderService.createOrder lança ORDER_050 para SELL sem posição aberta
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: AppError
Received constructor: TypeError

Received message: "Cannot read properties of null (reading 'quantity')"

      225 |             })

[Killed] BlockStatement
lib/services/OrderService.ts:130:36
         where: { userId, assetId: asset.id, status: 'OPEN', side: 'LONG' },
       })
       const ownedQty = position?.quantity ?? 0
-      if (ownedQty < dto.quantity) {
-        throw new AppError('ORDER_050', 402, {
-          required: dto.quantity,
-          available: ownedQty,
-          message: `Saldo de ativos insuficiente. Você tem ${ownedQty} ${dto.ticker}, mas a ordem requer ${dto.quantity}.`,
-        })
-      }
+      if (ownedQty < dto.quantity) {}
       requiredBalance = 0 // SELL não requer saldo em FS$
     }
killedBy: OrderService.createOrder lança ORDER_050 para SELL sem posição aberta
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"assetId": "asset-1", "fee": 4.5, "id": "order-1", "quantity": 10, "side": "BUY", "status": "OPEN", "type": "MARKET", "userId": "user-1"}

[Killed] ConditionalExpression
lib/services/OrderService.ts:130:11
         where: { userId, assetId: asset.id, status: 'OPEN', side: 'LONG' },
       })
       const ownedQty = position?.quantity ?? 0
-      if (ownedQty < dto.quantity) {
+      if (false) {
         throw new AppError('ORDER_050', 402, {
           required: dto.quantity,
killedBy: OrderService.createOrder lança ORDER_050 para SELL sem posição aberta
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"assetId": "asset-1", "fee": 4.5, "id": "order-1", "quantity": 10, "side": "BUY", "status": "OPEN", "type": "MARKET", "userId": "user-1"}

[Killed] EqualityOperator
lib/services/OrderService.ts:141:9
     }
 
     // === Motor Health Check (MARKET apenas) ===
-    if (dto.type === ORDER_TYPE.MARKET) {
+    if (dto.type !== ORDER_TYPE.MARKET) {
       const motorHealth = await redis.get('motor:health').catch(() => null)
       if (motorHealth === 'offline') {
killedBy: OrderService.createOrder lança MOTOR_090 quando motor offline
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"assetId": "asset-1", "fee": 4.5, "id": "order-1", "quantity": 10, "side": "BUY", "status": "OPEN", "type": "MARKET", "userId": "user-1"}

[Killed] ConditionalExpression
lib/services/OrderService.ts:141:9
     }
 
     // === Motor Health Check (MARKET apenas) ===
-    if (dto.type === ORDER_TYPE.MARKET) {
+    if (false) {
       const motorHealth = await redis.get('motor:health').catch(() => null)
       if (motorHealth === 'offline') {
killedBy: OrderService.createOrder lança MOTOR_090 quando motor offline
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"assetId": "asset-1", "fee": 4.5, "id": "order-1", "quantity": 10, "side": "BUY", "status": "OPEN", "type": "MARKET", "userId": "user-1"}

[Survived] ArrowFunction
lib/services/OrderService.ts:142:65
 
     // === Motor Health Check (MARKET apenas) ===
     if (dto.type === ORDER_TYPE.MARKET) {
-      const motorHealth = await redis.get('motor:health').catch(() => null)
+      const motorHealth = await redis.get('motor:health').catch(() => undefined)
       if (motorHealth === 'offline') {
         throw new AppError('MOTOR_090', 503, { message: 'Motor de mercado temporariamente indisponível.' })

[Killed] StringLiteral
lib/services/OrderService.ts:142:43
 
     // === Motor Health Check (MARKET apenas) ===
     if (dto.type === ORDER_TYPE.MARKET) {
-      const motorHealth = await redis.get('motor:health').catch(() => null)
+      const motorHealth = await redis.get("").catch(() => null)
       if (motorHealth === 'offline') {
         throw new AppError('MOTOR_090', 503, { message: 'Motor de mercado temporariamente indisponível.' })
killedBy: OrderService.createOrder lança MOTOR_090 quando motor offline
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"assetId": "asset-1", "fee": 4.5, "id": "order-1", "quantity": 10, "side": "BUY", "status": "OPEN", "type": "MARKET", "userId": "user-1"}

[Killed] EqualityOperator
lib/services/OrderService.ts:143:11
     // === Motor Health Check (MARKET apenas) ===
     if (dto.type === ORDER_TYPE.MARKET) {
       const motorHealth = await redis.get('motor:health').catch(() => null)
-      if (motorHealth === 'offline') {
+      if (motorHealth !== 'offline') {
         throw new AppError('MOTOR_090', 503, { message: 'Motor de mercado temporariamente indisponível.' })
       }
killedBy: OrderService.createOrder cria ordem MARKET BUY com sucesso
statusReason: AppError: MOTOR_090

[Killed] BlockStatement
lib/services/OrderService.ts:143:38
     // === Motor Health Check (MARKET apenas) ===
     if (dto.type === ORDER_TYPE.MARKET) {
       const motorHealth = await redis.get('motor:health').catch(() => null)
-      if (motorHealth === 'offline') {
-        throw new AppError('MOTOR_090', 503, { message: 'Motor de mercado temporariamente indisponível.' })
-      }
+      if (motorHealth === 'offline') {}
     }
 
killedBy: OrderService.createOrder lança MOTOR_090 quando motor offline
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"assetId": "asset-1", "fee": 4.5, "id": "order-1", "quantity": 10, "side": "BUY", "status": "OPEN", "type": "MARKET", "userId": "user-1"}

[Killed] StringLiteral
lib/services/OrderService.ts:144:28
     if (dto.type === ORDER_TYPE.MARKET) {
       const motorHealth = await redis.get('motor:health').catch(() => null)
       if (motorHealth === 'offline') {
-        throw new AppError('MOTOR_090', 503, { message: 'Motor de mercado temporariamente indisponível.' })
+        throw new AppError("", 503, { message: 'Motor de mercado temporariamente indisponível.' })
       }
     }
killedBy: OrderService.createOrder lança MOTOR_090 quando motor offline
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "MOTOR_090"
Received: ""

[Survived] StringLiteral
lib/services/OrderService.ts:144:57
     if (dto.type === ORDER_TYPE.MARKET) {
       const motorHealth = await redis.get('motor:health').catch(() => null)
       if (motorHealth === 'offline') {
-        throw new AppError('MOTOR_090', 503, { message: 'Motor de mercado temporariamente indisponível.' })
+        throw new AppError('MOTOR_090', 503, { message: "" })
       }
     }

[Survived] ConditionalExpression
lib/services/OrderService.ts:152:32
     // RESOLVED: race condition — debit e criação em prisma.$transaction atômico.
     // updateMany com WHERE fsBalance >= requiredBalance garante que saldo negativo
     // é impossível mesmo com requests concorrentes (sem lock separado).
-    const leverageMultiplier = dto.leverage === 2 ? 2 : 1
+    const leverageMultiplier = true ? 2 : 1
 
     // OCO: criar par atomicamente com groupId compartilhado + debit atômico

[Survived] EqualityOperator
lib/services/OrderService.ts:152:32
     // RESOLVED: race condition — debit e criação em prisma.$transaction atômico.
     // updateMany com WHERE fsBalance >= requiredBalance garante que saldo negativo
     // é impossível mesmo com requests concorrentes (sem lock separado).
-    const leverageMultiplier = dto.leverage === 2 ? 2 : 1
+    const leverageMultiplier = dto.leverage !== 2 ? 2 : 1
 
     // OCO: criar par atomicamente com groupId compartilhado + debit atômico

[Killed] ConditionalExpression
lib/services/OrderService.ts:155:9
     const leverageMultiplier = dto.leverage === 2 ? 2 : 1
 
     // OCO: criar par atomicamente com groupId compartilhado + debit atômico
-    if (dto.type === ORDER_TYPE.OCO) {
+    if (false) {
       const groupId = randomUUID()
       const baseData = {
killedBy: OrderService.createOrder cria ordem OCO BUY com sucesso
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

[Killed] ConditionalExpression
lib/services/OrderService.ts:155:9
     const leverageMultiplier = dto.leverage === 2 ? 2 : 1
 
     // OCO: criar par atomicamente com groupId compartilhado + debit atômico
-    if (dto.type === ORDER_TYPE.OCO) {
+    if (true) {
       const groupId = randomUUID()
       const baseData = {
killedBy: OrderService.createOrder cria ordem MARKET BUY com sucesso
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Survived] ObjectLiteral
lib/services/OrderService.ts:157:24
     // OCO: criar par atomicamente com groupId compartilhado + debit atômico
     if (dto.type === ORDER_TYPE.OCO) {
       const groupId = randomUUID()
-      const baseData = {
-        userId,
-        assetId: asset.id,
-        type: 'OCO' as import('@prisma/client').OrderType,
-        side: dto.side as import('@prisma/client').OrderSide,
-        status: 'OPEN' as const,
-        quantity: dto.quantity,
-        fee: feeAmount,
-        scheduledAt: null,
-        leverageMultiplier,
-        groupId,
-      }
+      const baseData = {}
 
       const [debitResult, stopLossLeg, takeProfitLeg] = await prisma.$transaction([

[Survived] ObjectLiteral
lib/services/OrderService.ts:172:32
 
       const [debitResult, stopLossLeg, takeProfitLeg] = await prisma.$transaction([
         // Debit atômico: apenas se saldo suficiente
-        prisma.user.updateMany({
-          where: {
-            id: userId,
-            ...(requiredBalance > 0 ? { fsBalance: { gte: requiredBalance } } : {}),
-          },
-          data: requiredBalance > 0 ? { fsBalance: { decrement: requiredBalance } } : {},
-        }),
+        prisma.user.updateMany({}),
         prisma.order.create({
           data: { ...baseData, price: dto.stopLossPrice! },

[Survived] EqualityOperator
lib/services/OrderService.ts:175:17
         prisma.user.updateMany({
           where: {
             id: userId,
-            ...(requiredBalance > 0 ? { fsBalance: { gte: requiredBalance } } : {}),
+            ...(requiredBalance <= 0 ? { fsBalance: { gte: requiredBalance } } : {}),
           },
           data: requiredBalance > 0 ? { fsBalance: { decrement: requiredBalance } } : {},

[Survived] EqualityOperator
lib/services/OrderService.ts:175:17
         prisma.user.updateMany({
           where: {
             id: userId,
-            ...(requiredBalance > 0 ? { fsBalance: { gte: requiredBalance } } : {}),
+            ...(requiredBalance >= 0 ? { fsBalance: { gte: requiredBalance } } : {}),
           },
           data: requiredBalance > 0 ? { fsBalance: { decrement: requiredBalance } } : {},

[Survived] EqualityOperator
lib/services/OrderService.ts:177:17
             id: userId,
             ...(requiredBalance > 0 ? { fsBalance: { gte: requiredBalance } } : {}),
           },
-          data: requiredBalance > 0 ? { fsBalance: { decrement: requiredBalance } } : {},
+          data: requiredBalance <= 0 ? { fsBalance: { decrement: requiredBalance } } : {},
         }),
         prisma.order.create({

[Survived] EqualityOperator
lib/services/OrderService.ts:177:17
             id: userId,
             ...(requiredBalance > 0 ? { fsBalance: { gte: requiredBalance } } : {}),
           },
-          data: requiredBalance > 0 ? { fsBalance: { decrement: requiredBalance } } : {},
+          data: requiredBalance >= 0 ? { fsBalance: { decrement: requiredBalance } } : {},
         }),
         prisma.order.create({
