[Survived] ObjectLiteral
lib/services/OrderService.ts:183:17
           data: { ...baseData, price: dto.stopLossPrice! },
         }),
         prisma.order.create({
-          data: { ...baseData, price: dto.takeProfitPrice! },
+          data: {},
         }),
       ])

[Killed] LogicalOperator
lib/services/OrderService.ts:187:11
         }),
       ])
 
-      if (requiredBalance > 0 && debitResult.count === 0) {
+      if (requiredBalance > 0 || debitResult.count === 0) {
         throw new AppError('ORDER_002', 402, {
           required: requiredBalance,
killedBy: OrderService.createOrder cria ordem OCO BUY com sucesso
statusReason: AppError: ORDER_002

[Killed] EqualityOperator
lib/services/OrderService.ts:187:34
         }),
       ])
 
-      if (requiredBalance > 0 && debitResult.count === 0) {
+      if (requiredBalance > 0 && debitResult.count !== 0) {
         throw new AppError('ORDER_002', 402, {
           required: requiredBalance,
killedBy: OrderService.createOrder cria ordem OCO BUY com sucesso
statusReason: AppError: ORDER_002

[Killed] StringLiteral
lib/services/OrderService.ts:188:28
       ])
 
       if (requiredBalance > 0 && debitResult.count === 0) {
-        throw new AppError('ORDER_002', 402, {
+        throw new AppError("", 402, {
           required: requiredBalance,
           message: `Saldo insuficiente para criar a ordem.`,
killedBy: OrderService.createOrder lança ORDER_002 para OCO com saldo insuficiente
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ORDER_002"
Received: ""

[Survived] ConditionalExpression
lib/services/OrderService.ts:211:15
       prisma.user.updateMany({
         where: {
           id: userId,
-          ...(requiredBalance > 0 ? { fsBalance: { gte: requiredBalance } } : {}),
+          ...(true ? { fsBalance: { gte: requiredBalance } } : {}),
         },
         data: requiredBalance > 0 ? { fsBalance: { decrement: requiredBalance } } : {},

[Survived] ConditionalExpression
lib/services/OrderService.ts:211:15
       prisma.user.updateMany({
         where: {
           id: userId,
-          ...(requiredBalance > 0 ? { fsBalance: { gte: requiredBalance } } : {}),
+          ...(false ? { fsBalance: { gte: requiredBalance } } : {}),
         },
         data: requiredBalance > 0 ? { fsBalance: { decrement: requiredBalance } } : {},

[Survived] ConditionalExpression
lib/services/OrderService.ts:213:15
           id: userId,
           ...(requiredBalance > 0 ? { fsBalance: { gte: requiredBalance } } : {}),
         },
-        data: requiredBalance > 0 ? { fsBalance: { decrement: requiredBalance } } : {},
+        data: false ? { fsBalance: { decrement: requiredBalance } } : {},
       }),
       prisma.order.create({

[Survived] ObjectLiteral
lib/services/OrderService.ts:215:27
         },
         data: requiredBalance > 0 ? { fsBalance: { decrement: requiredBalance } } : {},
       }),
-      prisma.order.create({
-        data: {
-          userId,
-          assetId: asset.id,
-          type: dto.type as import('@prisma/client').OrderType,
-          side: dto.side as import('@prisma/client').OrderSide,
-          status: 'OPEN',
-          quantity: dto.quantity,
-          price: dto.price ?? null,
-          fee: feeAmount,
-          scheduledAt: dto.scheduledAt ? new Date(dto.scheduledAt) : null,
-          leverageMultiplier,
-        },
-      }),
+      prisma.order.create({}),
     ])
 

[Survived] LogicalOperator
lib/services/OrderService.ts:223:18
           side: dto.side as import('@prisma/client').OrderSide,
           status: 'OPEN',
           quantity: dto.quantity,
-          price: dto.price ?? null,
+          price: dto.price && null,
           fee: feeAmount,
           scheduledAt: dto.scheduledAt ? new Date(dto.scheduledAt) : null,

[Killed] ConditionalExpression
lib/services/OrderService.ts:231:9
       }),
     ])
 
-    if (requiredBalance > 0 && debitResult.count === 0) {
+    if (false) {
       throw new AppError('ORDER_002', 402, {
         required: requiredBalance,
killedBy: OrderService.createOrder lança ORDER_002 quando saldo FS$ insuficiente para BUY (debit atômico — race condition)
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"assetId": "asset-1", "fee": 4.5, "id": "order-1", "quantity": 10, "side": "BUY", "status": "OPEN", "type": "MARKET", "userId": "user-1"}

[Killed] ConditionalExpression
lib/services/OrderService.ts:239:9
     }
 
     // Publicar para o motor (MARKET → processamento imediato)
-    if (dto.type === ORDER_TYPE.MARKET) {
+    if (false) {
       await redis.publish('orders:pending', JSON.stringify({ orderId: order.id, ticker: dto.ticker }))
     }
killedBy: OrderService.createOrder cria ordem MARKET BUY com sucesso
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "orders:pending", Any<String>

Number of calls: 0

[Killed] BlockStatement
lib/services/OrderService.ts:239:41
     }
 
     // Publicar para o motor (MARKET → processamento imediato)
-    if (dto.type === ORDER_TYPE.MARKET) {
-      await redis.publish('orders:pending', JSON.stringify({ orderId: order.id, ticker: dto.ticker }))
-    }
+    if (dto.type === ORDER_TYPE.MARKET) {}
 
     // Incrementar contador diário (Redis com TTL até meia-noite)
killedBy: OrderService.createOrder cria ordem MARKET BUY com sucesso
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "orders:pending", Any<String>

Number of calls: 0

[Survived] ObjectLiteral
lib/services/OrderService.ts:240:60
 
     // Publicar para o motor (MARKET → processamento imediato)
     if (dto.type === ORDER_TYPE.MARKET) {
-      await redis.publish('orders:pending', JSON.stringify({ orderId: order.id, ticker: dto.ticker }))
+      await redis.publish('orders:pending', JSON.stringify({}))
     }
 

[Killed] BlockStatement
lib/services/OrderService.ts:255:44
   async cancelOrder(userId: string, orderId: string): Promise<Order> {
     const order = await prisma.order.findUnique({ where: { id: orderId } })
 
-    if (!order || order.userId !== userId) {
-      throw new AppError('ORDER_080', 404, { message: 'Ordem não encontrada.' })
-    }
+    if (!order || order.userId !== userId) {}
 
     if (order.status !== ORDER_STATUS.OPEN && order.status !== 'PARTIAL') {
killedBy: OrderService.cancelOrder lança ORDER_080 para ordem de outro usuário (IDOR)
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"assetId": "asset-1", "fee": 4.5, "id": "order-1", "quantity": 10, "side": "BUY", "status": "CANCELLED", "type": "MARKET", "userId": "user-1"}

[Killed] ConditionalExpression
lib/services/OrderService.ts:255:9
   async cancelOrder(userId: string, orderId: string): Promise<Order> {
     const order = await prisma.order.findUnique({ where: { id: orderId } })
 
-    if (!order || order.userId !== userId) {
+    if (true) {
       throw new AppError('ORDER_080', 404, { message: 'Ordem não encontrada.' })
     }
killedBy: OrderService.cancelOrder cancela ordem OPEN com sucesso
statusReason: AppError: ORDER_080

[Killed] StringLiteral
lib/services/OrderService.ts:256:26
     const order = await prisma.order.findUnique({ where: { id: orderId } })
 
     if (!order || order.userId !== userId) {
-      throw new AppError('ORDER_080', 404, { message: 'Ordem não encontrada.' })
+      throw new AppError("", 404, { message: 'Ordem não encontrada.' })
     }
 
killedBy: OrderService.cancelOrder lança ORDER_080 para ordem de outro usuário (IDOR)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ORDER_080"
Received: ""

[Killed] ConditionalExpression
lib/services/OrderService.ts:259:9
       throw new AppError('ORDER_080', 404, { message: 'Ordem não encontrada.' })
     }
 
-    if (order.status !== ORDER_STATUS.OPEN && order.status !== 'PARTIAL') {
+    if (false) {
       throw new AppError('ORDER_053', order.status === ORDER_STATUS.FILLED ? 409 : 422, {
         message: order.status === ORDER_STATUS.FILLED
killedBy: OrderService.cancelOrder lança ORDER_053 para ordem FILLED (409)
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"assetId": "asset-1", "fee": 4.5, "id": "order-1", "quantity": 10, "side": "BUY", "status": "CANCELLED", "type": "MARKET", "userId": "user-1"}

[Killed] LogicalOperator
lib/services/OrderService.ts:259:9
       throw new AppError('ORDER_080', 404, { message: 'Ordem não encontrada.' })
     }
 
-    if (order.status !== ORDER_STATUS.OPEN && order.status !== 'PARTIAL') {
+    if (order.status !== ORDER_STATUS.OPEN || order.status !== 'PARTIAL') {
       throw new AppError('ORDER_053', order.status === ORDER_STATUS.FILLED ? 409 : 422, {
         message: order.status === ORDER_STATUS.FILLED
killedBy: OrderService.cancelOrder cancela ordem OPEN com sucesso
statusReason: AppError: ORDER_053

[Killed] ConditionalExpression
lib/services/OrderService.ts:260:39
     }
 
     if (order.status !== ORDER_STATUS.OPEN && order.status !== 'PARTIAL') {
-      throw new AppError('ORDER_053', order.status === ORDER_STATUS.FILLED ? 409 : 422, {
+      throw new AppError('ORDER_053', true ? 409 : 422, {
         message: order.status === ORDER_STATUS.FILLED
           ? 'Ordem já foi executada.'
killedBy: OrderService.cancelOrder lança ORDER_053 com status 422 para ordem não-cancelável (CANCELLED)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 422
Received: 409

[Killed] ConditionalExpression
lib/services/OrderService.ts:260:39
     }
 
     if (order.status !== ORDER_STATUS.OPEN && order.status !== 'PARTIAL') {
-      throw new AppError('ORDER_053', order.status === ORDER_STATUS.FILLED ? 409 : 422, {
+      throw new AppError('ORDER_053', false ? 409 : 422, {
         message: order.status === ORDER_STATUS.FILLED
           ? 'Ordem já foi executada.'
killedBy: OrderService.cancelOrder lança ORDER_053 para ordem FILLED (409)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 409
Received: 422

[Survived] ConditionalExpression
lib/services/OrderService.ts:261:18
 
     if (order.status !== ORDER_STATUS.OPEN && order.status !== 'PARTIAL') {
       throw new AppError('ORDER_053', order.status === ORDER_STATUS.FILLED ? 409 : 422, {
-        message: order.status === ORDER_STATUS.FILLED
+        message: true
           ? 'Ordem já foi executada.'
           : `Ordem não pode ser cancelada (status: ${order.status}).`,

[Survived] EqualityOperator
lib/services/OrderService.ts:261:18
 
     if (order.status !== ORDER_STATUS.OPEN && order.status !== 'PARTIAL') {
       throw new AppError('ORDER_053', order.status === ORDER_STATUS.FILLED ? 409 : 422, {
-        message: order.status === ORDER_STATUS.FILLED
+        message: order.status !== ORDER_STATUS.FILLED
           ? 'Ordem já foi executada.'
           : `Ordem não pode ser cancelada (status: ${order.status}).`,

[Survived] ObjectLiteral
lib/services/OrderService.ts:271:45
 
     // Refund atômico: cancelar ordem + devolver saldo/margin
     const cancelled = await prisma.$transaction(async (tx) => {
-      const updated = await tx.order.update({
-        where: { id: orderId },
-        data: { status: 'CANCELLED' },
-      })
+      const updated = await tx.order.update({})
 
       // Refund de saldo para ordens BUY

[Survived] StringLiteral
lib/services/OrderService.ts:273:25
     const cancelled = await prisma.$transaction(async (tx) => {
       const updated = await tx.order.update({
         where: { id: orderId },
-        data: { status: 'CANCELLED' },
+        data: { status: "" },
       })
 

[Killed] ConditionalExpression
lib/services/OrderService.ts:277:11
       })
 
       // Refund de saldo para ordens BUY
-      if (order.side === 'BUY' && order.price) {
+      if (false) {
         const operationValue = order.quantity * Number(order.price)
         const fee = calculateFee(operationValue)
killedBy: OrderService.cancelOrder realiza refund de saldo para ordem BUY com price
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"data": ObjectContaining {"fsBalance": Anything}}

Number of calls: 0

[Killed] EqualityOperator
lib/services/OrderService.ts:277:11
       })
 
       // Refund de saldo para ordens BUY
-      if (order.side === 'BUY' && order.price) {
+      if (order.side !== 'BUY' && order.price) {
         const operationValue = order.quantity * Number(order.price)
         const fee = calculateFee(operationValue)
killedBy: OrderService.cancelOrder realiza refund de saldo para ordem BUY com price
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"data": ObjectContaining {"fsBalance": Anything}}

Number of calls: 0

[Survived] ArithmeticOperator
lib/services/OrderService.ts:278:32
 
       // Refund de saldo para ordens BUY
       if (order.side === 'BUY' && order.price) {
-        const operationValue = order.quantity * Number(order.price)
+        const operationValue = order.quantity / Number(order.price)
         const fee = calculateFee(operationValue)
         const refundAmount = operationValue + fee

[Survived] ArithmeticOperator
lib/services/OrderService.ts:280:30
       if (order.side === 'BUY' && order.price) {
         const operationValue = order.quantity * Number(order.price)
         const fee = calculateFee(operationValue)
-        const refundAmount = operationValue + fee
+        const refundAmount = operationValue - fee
         await tx.user.update({
           where: { id: userId },

[Killed] ObjectLiteral
lib/services/OrderService.ts:281:30
         const operationValue = order.quantity * Number(order.price)
         const fee = calculateFee(operationValue)
         const refundAmount = operationValue + fee
-        await tx.user.update({
-          where: { id: userId },
-          data: { fsBalance: { increment: refundAmount } },
-        })
+        await tx.user.update({})
       }
 
killedBy: OrderService.cancelOrder realiza refund de saldo para ordem BUY com price
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"data": ObjectContaining {"fsBalance": Anything}}
Received: {}

Number of calls: 1

[Killed] EqualityOperator
lib/services/OrderService.ts:288:11
       }
 
       // Liberar marginBlocked para ordens SHORT
-      if (order.side === 'SELL') {
+      if (order.side !== 'SELL') {
         const asset = await tx.asset.findUnique({ where: { id: order.assetId } })
         if (asset) {
killedBy: OrderService.cancelOrder libera marginBlocked para ordem SELL com posição SHORT
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"data": ObjectContaining {"marginBlocked": Anything}}

Number of calls: 0

[Killed] BlockStatement
lib/services/OrderService.ts:288:34
       }
 
       // Liberar marginBlocked para ordens SHORT
-      if (order.side === 'SELL') {
-        const asset = await tx.asset.findUnique({ where: { id: order.assetId } })
-        if (asset) {
-          const position = await tx.position.findFirst({
-            where: { userId, assetId: order.assetId, status: 'OPEN', side: 'SHORT' },
-          })
-          if (position && Number(position.marginBlocked) > 0) {
-            const marginToRelease = order.quantity * Number(asset.currentPrice) * 1.5
-            await tx.position.update({
-              where: { id: position.id },
-              data: { marginBlocked: { decrement: Math.min(marginToRelease, Number(position.marginBlocked)) } },
-            })
-          }
-        }
-      }
+      if (order.side === 'SELL') {}
 
       return updated
killedBy: OrderService.cancelOrder libera marginBlocked para ordem SELL com posição SHORT
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"data": ObjectContaining {"marginBlocked": Anything}}

Number of calls: 0

[Killed] BlockStatement
lib/services/OrderService.ts:290:20
       // Liberar marginBlocked para ordens SHORT
       if (order.side === 'SELL') {
         const asset = await tx.asset.findUnique({ where: { id: order.assetId } })
-        if (asset) {
-          const position = await tx.position.findFirst({
-            where: { userId, assetId: order.assetId, status: 'OPEN', side: 'SHORT' },
-          })
-          if (position && Number(position.marginBlocked) > 0) {
-            const marginToRelease = order.quantity * Number(asset.currentPrice) * 1.5
-            await tx.position.update({
-              where: { id: position.id },
-              data: { marginBlocked: { decrement: Math.min(marginToRelease, Number(position.marginBlocked)) } },
-            })
-          }
-        }
+        if (asset) {}
       }
 
killedBy: OrderService.cancelOrder libera marginBlocked para ordem SELL com posição SHORT
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"data": ObjectContaining {"marginBlocked": Anything}}

Number of calls: 0

[Killed] ConditionalExpression
lib/services/OrderService.ts:290:13
       // Liberar marginBlocked para ordens SHORT
       if (order.side === 'SELL') {
         const asset = await tx.asset.findUnique({ where: { id: order.assetId } })
-        if (asset) {
+        if (false) {
           const position = await tx.position.findFirst({
             where: { userId, assetId: order.assetId, status: 'OPEN', side: 'SHORT' },
killedBy: OrderService.cancelOrder libera marginBlocked para ordem SELL com posição SHORT
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"data": ObjectContaining {"marginBlocked": Anything}}

Number of calls: 0

[Survived] ObjectLiteral
lib/services/OrderService.ts:292:20
         const asset = await tx.asset.findUnique({ where: { id: order.assetId } })
         if (asset) {
           const position = await tx.position.findFirst({
-            where: { userId, assetId: order.assetId, status: 'OPEN', side: 'SHORT' },
+            where: {},
           })
           if (position && Number(position.marginBlocked) > 0) {

[Killed] EqualityOperator
lib/services/OrderService.ts:294:27
           const position = await tx.position.findFirst({
             where: { userId, assetId: order.assetId, status: 'OPEN', side: 'SHORT' },
           })
-          if (position && Number(position.marginBlocked) > 0) {
+          if (position && Number(position.marginBlocked) <= 0) {
             const marginToRelease = order.quantity * Number(asset.currentPrice) * 1.5
             await tx.position.update({
killedBy: OrderService.cancelOrder libera marginBlocked para ordem SELL com posição SHORT
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"data": ObjectContaining {"marginBlocked": Anything}}

Number of calls: 0

[Killed] BlockStatement
lib/services/OrderService.ts:294:63
           const position = await tx.position.findFirst({
             where: { userId, assetId: order.assetId, status: 'OPEN', side: 'SHORT' },
           })
-          if (position && Number(position.marginBlocked) > 0) {
-            const marginToRelease = order.quantity * Number(asset.currentPrice) * 1.5
-            await tx.position.update({
-              where: { id: position.id },
-              data: { marginBlocked: { decrement: Math.min(marginToRelease, Number(position.marginBlocked)) } },
-            })
-          }
+          if (position && Number(position.marginBlocked) > 0) {}
         }
       }
killedBy: OrderService.cancelOrder libera marginBlocked para ordem SELL com posição SHORT
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"data": ObjectContaining {"marginBlocked": Anything}}

Number of calls: 0

[Survived] ArithmeticOperator
lib/services/OrderService.ts:295:37
             where: { userId, assetId: order.assetId, status: 'OPEN', side: 'SHORT' },
           })
           if (position && Number(position.marginBlocked) > 0) {
-            const marginToRelease = order.quantity * Number(asset.currentPrice) * 1.5
+            const marginToRelease = order.quantity * Number(asset.currentPrice) / 1.5
             await tx.position.update({
               where: { id: position.id },

[Survived] ArithmeticOperator
lib/services/OrderService.ts:295:37
             where: { userId, assetId: order.assetId, status: 'OPEN', side: 'SHORT' },
           })
           if (position && Number(position.marginBlocked) > 0) {
-            const marginToRelease = order.quantity * Number(asset.currentPrice) * 1.5
+            const marginToRelease = order.quantity / Number(asset.currentPrice) * 1.5
             await tx.position.update({
               where: { id: position.id },

[Survived] MethodExpression
lib/services/OrderService.ts:298:51
             const marginToRelease = order.quantity * Number(asset.currentPrice) * 1.5
             await tx.position.update({
               where: { id: position.id },
-              data: { marginBlocked: { decrement: Math.min(marginToRelease, Number(position.marginBlocked)) } },
+              data: { marginBlocked: { decrement: Math.max(marginToRelease, Number(position.marginBlocked)) } },
             })
           }

[Survived] ObjectLiteral
lib/services/OrderService.ts:298:38
             const marginToRelease = order.quantity * Number(asset.currentPrice) * 1.5
             await tx.position.update({
               where: { id: position.id },
-              data: { marginBlocked: { decrement: Math.min(marginToRelease, Number(position.marginBlocked)) } },
+              data: { marginBlocked: {} },
             })
           }

[Killed] ArrayDeclaration
lib/services/OrderService.ts:308:30
     })
 
     // Notificar motor e módulo de notificações
-    await Promise.allSettled([
-      redis.publish(`orders:cancelled:${userId}`, JSON.stringify({ orderId, motivo: 'Cancelado pelo usuário' })),
-      redis.publish(`notifications:${userId}`, JSON.stringify({
-        type: 'ORDER_CANCELLED',
-        orderId,
-        ticker: null, // assetId disponível na relation
-        motivo: 'Cancelado pelo usuário',
-      })),
-    ])
+    await Promise.allSettled([])
 
     return cancelled
killedBy: OrderService.cancelOrder cancela ordem OPEN com sucesso
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

[Survived] StringLiteral
lib/services/OrderService.ts:309:85
 
     // Notificar motor e módulo de notificações
     await Promise.allSettled([
-      redis.publish(`orders:cancelled:${userId}`, JSON.stringify({ orderId, motivo: 'Cancelado pelo usuário' })),
+      redis.publish(`orders:cancelled:${userId}`, JSON.stringify({ orderId, motivo: "" })),
       redis.publish(`notifications:${userId}`, JSON.stringify({
         type: 'ORDER_CANCELLED',

[Survived] StringLiteral
lib/services/OrderService.ts:309:21
 
     // Notificar motor e módulo de notificações
     await Promise.allSettled([
-      redis.publish(`orders:cancelled:${userId}`, JSON.stringify({ orderId, motivo: 'Cancelado pelo usuário' })),
+      redis.publish(``, JSON.stringify({ orderId, motivo: 'Cancelado pelo usuário' })),
       redis.publish(`notifications:${userId}`, JSON.stringify({
         type: 'ORDER_CANCELLED',

[Killed] LogicalOperator
lib/services/OrderService.ts:325:18
    * Lista ordens do usuário com paginação e filtros.
    */
   async getOrders(userId: string, filters: OrderFilters): Promise<PaginatedResult<Order>> {
-    const page = filters.page ?? 1
+    const page = filters.page && 1
     const limit = Math.min(filters.limit ?? 20, 100)
     const skip = (page - 1) * limit
killedBy: OrderService.getOrders retorna lista paginada sem filtros
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] MethodExpression
lib/services/OrderService.ts:326:19
    */
   async getOrders(userId: string, filters: OrderFilters): Promise<PaginatedResult<Order>> {
     const page = filters.page ?? 1
-    const limit = Math.min(filters.limit ?? 20, 100)
+    const limit = Math.max(filters.limit ?? 20, 100)
     const skip = (page - 1) * limit
 
killedBy: OrderService.getOrders respeita paginação (page e limit)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 100

[Killed] LogicalOperator
lib/services/OrderService.ts:326:28
    */
   async getOrders(userId: string, filters: OrderFilters): Promise<PaginatedResult<Order>> {
     const page = filters.page ?? 1
-    const limit = Math.min(filters.limit ?? 20, 100)
+    const limit = Math.min(filters.limit && 20, 100)
     const skip = (page - 1) * limit
 
killedBy: OrderService.getOrders retorna lista paginada sem filtros
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: NaN

[Killed] ArithmeticOperator
lib/services/OrderService.ts:327:19
   async getOrders(userId: string, filters: OrderFilters): Promise<PaginatedResult<Order>> {
     const page = filters.page ?? 1
     const limit = Math.min(filters.limit ?? 20, 100)
-    const skip = (page - 1) * limit
+    const skip = (page + 1) * limit
 
     const where: Record<string, unknown> = { userId }
killedBy: OrderService.getOrders respeita paginação (page e limit)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"skip": 10, "take": 10}
Received: {"orderBy": {"createdAt": "desc"}, "skip": 30, "take": 10, "where": {"userId": "user-1"}}

Number of calls: 1

[Killed] ArithmeticOperator
lib/services/OrderService.ts:327:18
   async getOrders(userId: string, filters: OrderFilters): Promise<PaginatedResult<Order>> {
     const page = filters.page ?? 1
     const limit = Math.min(filters.limit ?? 20, 100)
-    const skip = (page - 1) * limit
+    const skip = (page - 1) / limit
 
     const where: Record<string, unknown> = { userId }
killedBy: OrderService.getOrders respeita paginação (page e limit)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"skip": 10, "take": 10}
Received: {"orderBy": {"createdAt": "desc"}, "skip": 0.1, "take": 10, "where": {"userId": "user-1"}}

Number of calls: 1

[Killed] ObjectLiteral
lib/services/OrderService.ts:329:44
     const limit = Math.min(filters.limit ?? 20, 100)
     const skip = (page - 1) * limit
 
-    const where: Record<string, unknown> = { userId }
+    const where: Record<string, unknown> = {}
     if (filters.status) where.status = filters.status
     if (filters.type) where.type = filters.type
killedBy: OrderService.getOrders retorna lista paginada sem filtros
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"where": {"userId": "user-1"}}
Received: {"orderBy": {"createdAt": "desc"}, "skip": 0, "take": 20, "where": {}}

Number of calls: 1

[Killed] ConditionalExpression
lib/services/OrderService.ts:330:9
     const skip = (page - 1) * limit
 
     const where: Record<string, unknown> = { userId }
-    if (filters.status) where.status = filters.status
+    if (false) where.status = filters.status
     if (filters.type) where.type = filters.type
 
killedBy: OrderService.getOrders aplica filtro por status
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"where": ObjectContaining {"status": "OPEN"}}
Received: {"orderBy": {"createdAt": "desc"}, "skip": 0, "take": 20, "where": {"userId": "user-1"}}

Number of calls: 1

[Survived] ConditionalExpression
lib/services/OrderService.ts:330:9
     const skip = (page - 1) * limit
 
     const where: Record<string, unknown> = { userId }
-    if (filters.status) where.status = filters.status
+    if (true) where.status = filters.status
     if (filters.type) where.type = filters.type
 

[Killed] ConditionalExpression
lib/services/OrderService.ts:331:9
 
     const where: Record<string, unknown> = { userId }
     if (filters.status) where.status = filters.status
-    if (filters.type) where.type = filters.type
+    if (false) where.type = filters.type
 
     // Filtro por ticker requer join com asset
killedBy: OrderService.getOrders aplica filtro por type
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"where": ObjectContaining {"type": "MARKET"}}
Received: {"orderBy": {"createdAt": "desc"}, "skip": 0, "take": 20, "where": {"userId": "user-1"}}

Number of calls: 1

[Survived] ConditionalExpression
lib/services/OrderService.ts:331:9
 
     const where: Record<string, unknown> = { userId }
     if (filters.status) where.status = filters.status
-    if (filters.type) where.type = filters.type
+    if (true) where.type = filters.type
 
     // Filtro por ticker requer join com asset
