[Killed] BlockStatement
lib/services/OrderService.ts:335:25
 
     // Filtro por ticker requer join com asset
     let assetId: string | undefined
-    if (filters.ticker) {
-      const asset = await prisma.asset.findUnique({ where: { ticker: filters.ticker } })
-      assetId = asset?.id
-      if (!assetId) return { data: [], pagination: { page, limit, total: 0, totalPages: 0 } }
-      where.assetId = assetId
-    }
+    if (filters.ticker) {}
 
     const [data, total] = await Promise.all([
killedBy: OrderService.getOrders retorna lista vazia quando ticker não encontrado
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  [{"assetId": "asset-1", "fee": 4.5, "id": "order-1", "quantity": 10, "side": "BUY", "status": "OPEN", "type": "MARKET", "userId": "user-1"}]

[Killed] ConditionalExpression
lib/services/OrderService.ts:335:9
 
     // Filtro por ticker requer join com asset
     let assetId: string | undefined
-    if (filters.ticker) {
+    if (false) {
       const asset = await prisma.asset.findUnique({ where: { ticker: filters.ticker } })
       assetId = asset?.id
killedBy: OrderService.getOrders retorna lista vazia quando ticker não encontrado
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  [{"assetId": "asset-1", "fee": 4.5, "id": "order-1", "quantity": 10, "side": "BUY", "status": "OPEN", "type": "MARKET", "userId": "user-1"}]

[Survived] ObjectLiteral
lib/services/OrderService.ts:336:51
     // Filtro por ticker requer join com asset
     let assetId: string | undefined
     if (filters.ticker) {
-      const asset = await prisma.asset.findUnique({ where: { ticker: filters.ticker } })
+      const asset = await prisma.asset.findUnique({})
       assetId = asset?.id
       if (!assetId) return { data: [], pagination: { page, limit, total: 0, totalPages: 0 } }

[Killed] OptionalChaining
lib/services/OrderService.ts:337:17
     let assetId: string | undefined
     if (filters.ticker) {
       const asset = await prisma.asset.findUnique({ where: { ticker: filters.ticker } })
-      assetId = asset?.id
+      assetId = asset.id
       if (!assetId) return { data: [], pagination: { page, limit, total: 0, totalPages: 0 } }
       where.assetId = assetId
killedBy: OrderService.getOrders retorna lista vazia quando ticker não encontrado
statusReason: TypeError: Cannot read properties of null (reading 'id')

[Killed] BooleanLiteral
lib/services/OrderService.ts:338:11
     if (filters.ticker) {
       const asset = await prisma.asset.findUnique({ where: { ticker: filters.ticker } })
       assetId = asset?.id
-      if (!assetId) return { data: [], pagination: { page, limit, total: 0, totalPages: 0 } }
+      if (assetId) return { data: [], pagination: { page, limit, total: 0, totalPages: 0 } }
       where.assetId = assetId
     }
killedBy: OrderService.getOrders retorna lista vazia quando ticker não encontrado
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  [{"assetId": "asset-1", "fee": 4.5, "id": "order-1", "quantity": 10, "side": "BUY", "status": "OPEN", "type": "MARKET", "userId": "user-1"}]

[Killed] ConditionalExpression
lib/services/OrderService.ts:338:11
     if (filters.ticker) {
       const asset = await prisma.asset.findUnique({ where: { ticker: filters.ticker } })
       assetId = asset?.id
-      if (!assetId) return { data: [], pagination: { page, limit, total: 0, totalPages: 0 } }
+      if (false) return { data: [], pagination: { page, limit, total: 0, totalPages: 0 } }
       where.assetId = assetId
     }
killedBy: OrderService.getOrders retorna lista vazia quando ticker não encontrado
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 1
Received array:  [{"assetId": "asset-1", "fee": 4.5, "id": "order-1", "quantity": 10, "side": "BUY", "status": "OPEN", "type": "MARKET", "userId": "user-1"}]

[Killed] ObjectLiteral
lib/services/OrderService.ts:343:29
     }
 
     const [data, total] = await Promise.all([
-      prisma.order.findMany({ where, skip, take: limit, orderBy: { createdAt: 'desc' } }),
+      prisma.order.findMany({}),
       prisma.order.count({ where }),
     ])
killedBy: OrderService.getOrders retorna lista paginada sem filtros
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"where": {"userId": "user-1"}}
Received: {}

Number of calls: 1

[Killed] ArithmeticOperator
lib/services/OrderService.ts:349:63
 
     return {
       data,
-      pagination: { page, limit, total, totalPages: Math.ceil(total / limit) },
+      pagination: { page, limit, total, totalPages: Math.ceil(total * limit) },
     }
   }
killedBy: OrderService.getOrders retorna lista paginada sem filtros
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 20

[Killed] ObjectLiteral
lib/services/OrderService.ts:349:19
 
     return {
       data,
-      pagination: { page, limit, total, totalPages: Math.ceil(total / limit) },
+      pagination: {},
     }
   }
killedBy: OrderService.getOrders retorna lista paginada sem filtros
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] BlockStatement
lib/services/OrderService.ts:356:67
   /**
    * Busca uma ordem específica do usuário (com proteção IDOR).
    */
-  async getOrder(userId: string, orderId: string): Promise<Order> {
-    const order = await prisma.order.findUnique({ where: { id: orderId } })
-    if (!order || order.userId !== userId) {
-      throw new AppError('ORDER_080', 404, { message: 'Ordem não encontrada.' })
-    }
-    return order
-  }
+  async getOrder(userId: string, orderId: string): Promise<Order> {}
 
   // ---------------------------------------------------------------------------
killedBy: OrderService.getOrder retorna ordem do usuário correto
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Survived] ObjectLiteral
lib/services/OrderService.ts:357:58
    * Busca uma ordem específica do usuário (com proteção IDOR).
    */
   async getOrder(userId: string, orderId: string): Promise<Order> {
-    const order = await prisma.order.findUnique({ where: { id: orderId } })
+    const order = await prisma.order.findUnique({ where: {} })
     if (!order || order.userId !== userId) {
       throw new AppError('ORDER_080', 404, { message: 'Ordem não encontrada.' })

[Killed] ConditionalExpression
lib/services/OrderService.ts:358:19
    */
   async getOrder(userId: string, orderId: string): Promise<Order> {
     const order = await prisma.order.findUnique({ where: { id: orderId } })
-    if (!order || order.userId !== userId) {
+    if (!order || false) {
       throw new AppError('ORDER_080', 404, { message: 'Ordem não encontrada.' })
     }
killedBy: OrderService.getOrder lança ORDER_080 para ordem de outro usuário (IDOR)
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"assetId": "asset-1", "fee": 4.5, "id": "order-1", "quantity": 10, "side": "BUY", "status": "OPEN", "type": "MARKET", "userId": "user-2"}

[Killed] EqualityOperator
lib/services/OrderService.ts:358:19
    */
   async getOrder(userId: string, orderId: string): Promise<Order> {
     const order = await prisma.order.findUnique({ where: { id: orderId } })
-    if (!order || order.userId !== userId) {
+    if (!order || order.userId === userId) {
       throw new AppError('ORDER_080', 404, { message: 'Ordem não encontrada.' })
     }
killedBy: OrderService.getOrder retorna ordem do usuário correto
statusReason: AppError: ORDER_080

[Killed] ConditionalExpression
lib/services/OrderService.ts:370:9
 
   private async _checkDailyLimit(userId: string, planType: PlanType): Promise<void> {
     const limit = DAILY_ORDER_LIMITS_BY_PLAN[planType]
-    if (limit === Infinity) return
+    if (true) return
 
     const today = new Date().toISOString().slice(0, 10)
killedBy: OrderService.createOrder lança ORDER_052 quando limite diário atingido (Jogador)
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"assetId": "asset-1", "fee": 4.5, "id": "order-1", "quantity": 10, "side": "BUY", "status": "OPEN", "type": "MARKET", "userId": "user-1"}

[Killed] EqualityOperator
lib/services/OrderService.ts:370:9
 
   private async _checkDailyLimit(userId: string, planType: PlanType): Promise<void> {
     const limit = DAILY_ORDER_LIMITS_BY_PLAN[planType]
-    if (limit === Infinity) return
+    if (limit !== Infinity) return
 
     const today = new Date().toISOString().slice(0, 10)
killedBy: OrderService.createOrder lança ORDER_052 quando limite diário atingido (Jogador)
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"assetId": "asset-1", "fee": 4.5, "id": "order-1", "quantity": 10, "side": "BUY", "status": "OPEN", "type": "MARKET", "userId": "user-1"}

[Killed] MethodExpression
lib/services/OrderService.ts:372:19
     const limit = DAILY_ORDER_LIMITS_BY_PLAN[planType]
     if (limit === Infinity) return
 
-    const today = new Date().toISOString().slice(0, 10)
+    const today = new Date().toISOString()
     const redisKey = `order:daily:${userId}:${today}`
 
killedBy: OrderService.createOrder lança ORDER_052 quando limite diário atingido (Jogador)
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: AppError
Received constructor: RangeError

Received message: "Invalid time value"

      688 |             limit,

[Killed] BlockStatement
lib/services/OrderService.ts:376:9
     const redisKey = `order:daily:${userId}:${today}`
 
     let count: number
-    try {
-      const val = await redis.get(redisKey)
-      count = val ? parseInt(val, 10) : 0
-    } catch {
+    try {} catch {
       // Fallback para banco se Redis indisponível
       const startOfDay = new Date(`${today}T00:00:00.000Z`)
killedBy: OrderService.createOrder lança ORDER_052 quando limite diário atingido (Jogador)
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"assetId": "asset-1", "fee": 4.5, "id": "order-1", "quantity": 10, "side": "BUY", "status": "OPEN", "type": "MARKET", "userId": "user-1"}

[Killed] BlockStatement
lib/services/OrderService.ts:379:13
     try {
       const val = await redis.get(redisKey)
       count = val ? parseInt(val, 10) : 0
-    } catch {
-      // Fallback para banco se Redis indisponível
-      const startOfDay = new Date(`${today}T00:00:00.000Z`)
-      const endOfDay = new Date(`${today}T23:59:59.999Z`)
-      count = await prisma.order.count({
-        where: {
-          userId,
-          createdAt: { gte: startOfDay, lte: endOfDay },
-          status: { not: 'CANCELLED' },
-          type: { not: 'SCHEDULED' },
-        },
-      })
-    }
+    } catch {}
 
     if (count >= limit) {
killedBy: OrderService.createOrder usa fallback DB para limite diário quando Redis indisponível
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] ObjectLiteral
lib/services/OrderService.ts:383:40
       // Fallback para banco se Redis indisponível
       const startOfDay = new Date(`${today}T00:00:00.000Z`)
       const endOfDay = new Date(`${today}T23:59:59.999Z`)
-      count = await prisma.order.count({
-        where: {
-          userId,
-          createdAt: { gte: startOfDay, lte: endOfDay },
-          status: { not: 'CANCELLED' },
-          type: { not: 'SCHEDULED' },
-        },
-      })
+      count = await prisma.order.count({})
     }
 

[Survived] ObjectLiteral
lib/services/OrderService.ts:388:17
           userId,
           createdAt: { gte: startOfDay, lte: endOfDay },
           status: { not: 'CANCELLED' },
-          type: { not: 'SCHEDULED' },
+          type: {},
         },
       })

[Survived] StringLiteral
lib/services/OrderService.ts:388:24
           userId,
           createdAt: { gte: startOfDay, lte: endOfDay },
           status: { not: 'CANCELLED' },
-          type: { not: 'SCHEDULED' },
+          type: { not: "" },
         },
       })

[Killed] ConditionalExpression
lib/services/OrderService.ts:393:9
       })
     }
 
-    if (count >= limit) {
+    if (true) {
       const nextMidnight = new Date(`${today}T00:00:00.000Z`)
       nextMidnight.setDate(nextMidnight.getDate() + 1)
killedBy: OrderService.createOrder cria ordem MARKET BUY com sucesso
statusReason: AppError: ORDER_052

[Killed] EqualityOperator
lib/services/OrderService.ts:393:9
       })
     }
 
-    if (count >= limit) {
+    if (count > limit) {
       const nextMidnight = new Date(`${today}T00:00:00.000Z`)
       nextMidnight.setDate(nextMidnight.getDate() + 1)
killedBy: OrderService.createOrder lança ORDER_052 quando limite diário atingido (Jogador)
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"assetId": "asset-1", "fee": 4.5, "id": "order-1", "quantity": 10, "side": "BUY", "status": "OPEN", "type": "MARKET", "userId": "user-1"}

[Killed] StringLiteral
lib/services/OrderService.ts:394:37
     }
 
     if (count >= limit) {
-      const nextMidnight = new Date(`${today}T00:00:00.000Z`)
+      const nextMidnight = new Date(``)
       nextMidnight.setDate(nextMidnight.getDate() + 1)
       throw new AppError('ORDER_052', 429, {
killedBy: OrderService.createOrder lança ORDER_052 quando limite diário atingido (Jogador)
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: AppError
Received constructor: RangeError

Received message: "Invalid time value"

      688 |             limit,

[Survived] MethodExpression
lib/services/OrderService.ts:395:7
 
     if (count >= limit) {
       const nextMidnight = new Date(`${today}T00:00:00.000Z`)
-      nextMidnight.setDate(nextMidnight.getDate() + 1)
+      nextMidnight.setTime(nextMidnight.getDate() + 1)
       throw new AppError('ORDER_052', 429, {
         limit,

[Survived] ArithmeticOperator
lib/services/OrderService.ts:395:28
 
     if (count >= limit) {
       const nextMidnight = new Date(`${today}T00:00:00.000Z`)
-      nextMidnight.setDate(nextMidnight.getDate() + 1)
+      nextMidnight.setDate(nextMidnight.getDate() - 1)
       throw new AppError('ORDER_052', 429, {
         limit,

[Survived] ObjectLiteral
lib/services/OrderService.ts:396:44
     if (count >= limit) {
       const nextMidnight = new Date(`${today}T00:00:00.000Z`)
       nextMidnight.setDate(nextMidnight.getDate() + 1)
-      throw new AppError('ORDER_052', 429, {
-        limit,
-        planType,
-        resetAt: nextMidnight.toISOString(),
-        message: `Limite diário de ${limit} ordens atingido para o plano ${planType}.`,
-      })
+      throw new AppError('ORDER_052', 429, {})
     }
   }

[Killed] BlockStatement
lib/services/OrderService.ts:405:54
     }
   }
 
-  private async _checkMarketSession(): Promise<void> {
-    try {
-      const session = await redis.get('market:session')
-      if (session && session !== 'NEGOCIACAO') {
-        const messages: Record<string, string> = {
-          FECHADO: 'Mercado fechado. Ordens MARKET são aceitas apenas durante o pregão.',
-          PRE_ABERTURA: 'Mercado em pré-abertura. Aguarde o início do pregão.',
-          CALL: 'Mercado em leilão de fechamento. Tente novamente após o pregão.',
-          AFTER_MARKET: 'Mercado em after-market. Ordens MARKET não são aceitas nesta sessão.',
-        }
-        throw new AppError('SESS_040', 422, {
-          session,
-          message: messages[session] ?? 'Mercado indisponível para ordens MARKET.',
-        })
-      }
-    } catch (err) {
-      if (err instanceof AppError) throw err
-      // Redis indisponível — permitir (fail open para não bloquear operações)
-    }
-  }
+  private async _checkMarketSession(): Promise<void> {}
 
   private async _incrementDailyCounter(userId: string): Promise<void> {
killedBy: OrderService.createOrder lança SESS_040 quando sessão de mercado está FECHADO
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"assetId": "asset-1", "fee": 4.5, "id": "order-1", "quantity": 10, "side": "BUY", "status": "OPEN", "type": "MARKET", "userId": "user-1"}

[Killed] BlockStatement
lib/services/OrderService.ts:406:9
   }
 
   private async _checkMarketSession(): Promise<void> {
-    try {
-      const session = await redis.get('market:session')
-      if (session && session !== 'NEGOCIACAO') {
-        const messages: Record<string, string> = {
-          FECHADO: 'Mercado fechado. Ordens MARKET são aceitas apenas durante o pregão.',
-          PRE_ABERTURA: 'Mercado em pré-abertura. Aguarde o início do pregão.',
-          CALL: 'Mercado em leilão de fechamento. Tente novamente após o pregão.',
-          AFTER_MARKET: 'Mercado em after-market. Ordens MARKET não são aceitas nesta sessão.',
-        }
-        throw new AppError('SESS_040', 422, {
-          session,
-          message: messages[session] ?? 'Mercado indisponível para ordens MARKET.',
-        })
-      }
-    } catch (err) {
+    try {} catch (err) {
       if (err instanceof AppError) throw err
       // Redis indisponível — permitir (fail open para não bloquear operações)
killedBy: OrderService.createOrder lança SESS_040 quando sessão de mercado está FECHADO
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"assetId": "asset-1", "fee": 4.5, "id": "order-1", "quantity": 10, "side": "BUY", "status": "OPEN", "type": "MARKET", "userId": "user-1"}

[Killed] LogicalOperator
lib/services/OrderService.ts:408:11
   private async _checkMarketSession(): Promise<void> {
     try {
       const session = await redis.get('market:session')
-      if (session && session !== 'NEGOCIACAO') {
+      if (session || session !== 'NEGOCIACAO') {
         const messages: Record<string, string> = {
           FECHADO: 'Mercado fechado. Ordens MARKET são aceitas apenas durante o pregão.',
killedBy: OrderService.createOrder cria ordem MARKET BUY com sucesso
statusReason: AppError: SESS_040

[Killed] ConditionalExpression
lib/services/OrderService.ts:408:11
   private async _checkMarketSession(): Promise<void> {
     try {
       const session = await redis.get('market:session')
-      if (session && session !== 'NEGOCIACAO') {
+      if (true) {
         const messages: Record<string, string> = {
           FECHADO: 'Mercado fechado. Ordens MARKET são aceitas apenas durante o pregão.',
killedBy: OrderService.createOrder cria ordem MARKET BUY com sucesso
statusReason: AppError: SESS_040

[Survived] StringLiteral
lib/services/OrderService.ts:412:17
         const messages: Record<string, string> = {
           FECHADO: 'Mercado fechado. Ordens MARKET são aceitas apenas durante o pregão.',
           PRE_ABERTURA: 'Mercado em pré-abertura. Aguarde o início do pregão.',
-          CALL: 'Mercado em leilão de fechamento. Tente novamente após o pregão.',
+          CALL: "",
           AFTER_MARKET: 'Mercado em after-market. Ordens MARKET não são aceitas nesta sessão.',
         }

[Survived] StringLiteral
lib/services/OrderService.ts:413:25
           FECHADO: 'Mercado fechado. Ordens MARKET são aceitas apenas durante o pregão.',
           PRE_ABERTURA: 'Mercado em pré-abertura. Aguarde o início do pregão.',
           CALL: 'Mercado em leilão de fechamento. Tente novamente após o pregão.',
-          AFTER_MARKET: 'Mercado em after-market. Ordens MARKET não são aceitas nesta sessão.',
+          AFTER_MARKET: "",
         }
         throw new AppError('SESS_040', 422, {

[Killed] StringLiteral
lib/services/OrderService.ts:415:28
           CALL: 'Mercado em leilão de fechamento. Tente novamente após o pregão.',
           AFTER_MARKET: 'Mercado em after-market. Ordens MARKET não são aceitas nesta sessão.',
         }
-        throw new AppError('SESS_040', 422, {
+        throw new AppError("", 422, {
           session,
           message: messages[session] ?? 'Mercado indisponível para ordens MARKET.',
killedBy: OrderService.createOrder lança SESS_040 quando sessão de mercado está FECHADO
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "SESS_040"
Received: ""

[Survived] ObjectLiteral
lib/services/OrderService.ts:415:45
           CALL: 'Mercado em leilão de fechamento. Tente novamente após o pregão.',
           AFTER_MARKET: 'Mercado em after-market. Ordens MARKET não são aceitas nesta sessão.',
         }
-        throw new AppError('SESS_040', 422, {
-          session,
-          message: messages[session] ?? 'Mercado indisponível para ordens MARKET.',
-        })
+        throw new AppError('SESS_040', 422, {})
       }
     } catch (err) {

[Survived] LogicalOperator
lib/services/OrderService.ts:417:20
         }
         throw new AppError('SESS_040', 422, {
           session,
-          message: messages[session] ?? 'Mercado indisponível para ordens MARKET.',
+          message: messages[session] && 'Mercado indisponível para ordens MARKET.',
         })
       }

[Killed] BlockStatement
lib/services/OrderService.ts:420:19
           message: messages[session] ?? 'Mercado indisponível para ordens MARKET.',
         })
       }
-    } catch (err) {
-      if (err instanceof AppError) throw err
-      // Redis indisponível — permitir (fail open para não bloquear operações)
-    }
+    } catch (err) {}
   }
 
killedBy: OrderService.createOrder lança SESS_040 quando sessão de mercado está FECHADO
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"assetId": "asset-1", "fee": 4.5, "id": "order-1", "quantity": 10, "side": "BUY", "status": "OPEN", "type": "MARKET", "userId": "user-1"}

[Killed] ConditionalExpression
lib/services/OrderService.ts:421:11
         })
       }
     } catch (err) {
-      if (err instanceof AppError) throw err
+      if (true) throw err
       // Redis indisponível — permitir (fail open para não bloquear operações)
     }
killedBy: OrderService.createOrder permite ordem MARKET quando market:session Redis indisponível (fail open)
statusReason: Error: Redis down

[Killed] ConditionalExpression
lib/services/OrderService.ts:421:11
         })
       }
     } catch (err) {
-      if (err instanceof AppError) throw err
+      if (false) throw err
       // Redis indisponível — permitir (fail open para não bloquear operações)
     }
killedBy: OrderService.createOrder lança SESS_040 quando sessão de mercado está FECHADO
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"assetId": "asset-1", "fee": 4.5, "id": "order-1", "quantity": 10, "side": "BUY", "status": "OPEN", "type": "MARKET", "userId": "user-1"}

[Survived] BlockStatement
lib/services/OrderService.ts:426:71
     }
   }
 
-  private async _incrementDailyCounter(userId: string): Promise<void> {
-    const today = new Date().toISOString().slice(0, 10)
-    const redisKey = `order:daily:${userId}:${today}`
-    try {
-      const count = await redis.incr(redisKey)
-      if (count === 1) {
-        // Definir TTL até fim do dia (máx 24h)
-        const now = new Date()
-        const endOfDay = new Date(`${today}T23:59:59.000Z`)
-        const ttl = Math.ceil((endOfDay.getTime() - now.getTime()) / 1000)
-        if (ttl > 0) await redis.expire(redisKey, ttl)
-      }
-    } catch {
-      // Falha silenciosa — o fallback do banco será usado na próxima validação
-    }
-  }
+  private async _incrementDailyCounter(userId: string): Promise<void> {}
 }
 

[Survived] MethodExpression
lib/services/OrderService.ts:427:19
   }
 
   private async _incrementDailyCounter(userId: string): Promise<void> {
-    const today = new Date().toISOString().slice(0, 10)
+    const today = new Date().toISOString()
     const redisKey = `order:daily:${userId}:${today}`
     try {

[Survived] StringLiteral
lib/services/OrderService.ts:428:22
 
   private async _incrementDailyCounter(userId: string): Promise<void> {
     const today = new Date().toISOString().slice(0, 10)
-    const redisKey = `order:daily:${userId}:${today}`
+    const redisKey = ``
     try {
       const count = await redis.incr(redisKey)

[Survived] BlockStatement
lib/services/OrderService.ts:429:9
   private async _incrementDailyCounter(userId: string): Promise<void> {
     const today = new Date().toISOString().slice(0, 10)
     const redisKey = `order:daily:${userId}:${today}`
-    try {
-      const count = await redis.incr(redisKey)
-      if (count === 1) {
-        // Definir TTL até fim do dia (máx 24h)
-        const now = new Date()
-        const endOfDay = new Date(`${today}T23:59:59.000Z`)
-        const ttl = Math.ceil((endOfDay.getTime() - now.getTime()) / 1000)
-        if (ttl > 0) await redis.expire(redisKey, ttl)
-      }
-    } catch {
+    try {} catch {
       // Falha silenciosa — o fallback do banco será usado na próxima validação
     }

[Survived] ConditionalExpression
lib/services/OrderService.ts:431:11
     const redisKey = `order:daily:${userId}:${today}`
     try {
       const count = await redis.incr(redisKey)
-      if (count === 1) {
+      if (true) {
         // Definir TTL até fim do dia (máx 24h)
         const now = new Date()

[Survived] ConditionalExpression
lib/services/OrderService.ts:431:11
     const redisKey = `order:daily:${userId}:${today}`
     try {
       const count = await redis.incr(redisKey)
-      if (count === 1) {
+      if (false) {
         // Definir TTL até fim do dia (máx 24h)
         const now = new Date()

[Survived] StringLiteral
lib/services/OrderService.ts:434:35
       if (count === 1) {
         // Definir TTL até fim do dia (máx 24h)
         const now = new Date()
-        const endOfDay = new Date(`${today}T23:59:59.000Z`)
+        const endOfDay = new Date(``)
         const ttl = Math.ceil((endOfDay.getTime() - now.getTime()) / 1000)
         if (ttl > 0) await redis.expire(redisKey, ttl)

[Survived] ArithmeticOperator
lib/services/OrderService.ts:435:32
         // Definir TTL até fim do dia (máx 24h)
         const now = new Date()
         const endOfDay = new Date(`${today}T23:59:59.000Z`)
-        const ttl = Math.ceil((endOfDay.getTime() - now.getTime()) / 1000)
+        const ttl = Math.ceil((endOfDay.getTime() + now.getTime()) / 1000)
         if (ttl > 0) await redis.expire(redisKey, ttl)
       }

[Survived] ArithmeticOperator
lib/services/OrderService.ts:435:31
         // Definir TTL até fim do dia (máx 24h)
         const now = new Date()
         const endOfDay = new Date(`${today}T23:59:59.000Z`)
-        const ttl = Math.ceil((endOfDay.getTime() - now.getTime()) / 1000)
+        const ttl = Math.ceil((endOfDay.getTime() - now.getTime()) * 1000)
         if (ttl > 0) await redis.expire(redisKey, ttl)
       }

[Survived] EqualityOperator
lib/services/OrderService.ts:436:13
         const now = new Date()
         const endOfDay = new Date(`${today}T23:59:59.000Z`)
         const ttl = Math.ceil((endOfDay.getTime() - now.getTime()) / 1000)
-        if (ttl > 0) await redis.expire(redisKey, ttl)
+        if (ttl <= 0) await redis.expire(redisKey, ttl)
       }
     } catch {

[Survived] ConditionalExpression
lib/services/OrderService.ts:436:13
         const now = new Date()
         const endOfDay = new Date(`${today}T23:59:59.000Z`)
         const ttl = Math.ceil((endOfDay.getTime() - now.getTime()) / 1000)
-        if (ttl > 0) await redis.expire(redisKey, ttl)
+        if (false) await redis.expire(redisKey, ttl)
       }
     } catch {
